In [53]:
import numpy as np
import pandas as pd

In [54]:
dict1 = {
    "name":['priyanshu','rohan','sohan','skillf','yyyy'],
    "marks":[92, 34, 44,54,55],
    "city":['lucknow','delhi','kanpur','bareilly','goa']
}

In [55]:
df = pd.DataFrame(dict1)

In [56]:
df

        name  marks      city
0  priyanshu     92   lucknow
1      rohan     34     delhi
2      sohan     44    kanpur
3     skillf     54  bareilly
4       yyyy     55       goa

In [57]:
df.to_csv('friends.csv')

In [58]:
df.to_csv('friends_indexfalse.csv', index = False)

In [59]:
df.head(2)

        name  marks     city
0  priyanshu     92  lucknow
1      rohan     34    delhi

In [60]:
df.tail(3)

     name  marks      city
2   sohan     44    kanpur
3  skillf     54  bareilly
4    yyyy     55       goa

In [61]:
df.describe()

           marks
count   5.000000
mean   55.800000
std    21.959053
min    34.000000
25%    44.000000
50%    54.000000
75%    55.000000
max    92.000000

In [62]:
df.describe(include='all')

             name      marks     city
count           5   5.000000        5
unique          5        NaN        5
top     priyanshu        NaN  lucknow
freq            1        NaN        1
mean          NaN  55.800000      NaN
std           NaN  21.959053      NaN
min           NaN  34.000000      NaN
25%           NaN  44.000000      NaN
50%           NaN  54.000000      NaN
75%           NaN  55.000000      NaN
max           NaN  92.000000      NaN

In [63]:
priyanshu = pd.read_csv('priyanshu.csv')

In [64]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai
4      1111    111            yyyyS

In [65]:
priyanshu.head(3)

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath

In [66]:
priyanshu.tail(2)

   train_no  speed     city
3      2345    435  chennai
4      1111    111    yyyyS

In [67]:
priyanshu.describe()

           train_no      speed
count      5.000000    5.00000
mean   12513.200000  229.60000
std    10836.784934  149.67899
min     1111.000000  111.00000
25%     2345.000000  125.00000
50%    12344.000000  133.00000
75%    23322.000000  344.00000
max    23444.000000  435.00000

In [68]:
priyanshu.describe(include='all')

            train_no      speed     city
count       5.000000    5.00000        5
unique           NaN        NaN        5
top              NaN        NaN  lucknow
freq             NaN        NaN        1
mean    12513.200000  229.60000      NaN
std     10836.784934  149.67899      NaN
min      1111.000000  111.00000      NaN
25%      2345.000000  125.00000      NaN
50%     12344.000000  133.00000      NaN
75%     23322.000000  344.00000      NaN
max     23444.000000  435.00000      NaN

In [69]:
priyanshu['speed'][0]= 125

C:\Users\verma\AppData\Local\Temp\ipykernel_15752\2568459189.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  priyanshu['speed'][0]= 125
C:\Users\verma\AppData\Local\Temp\ipykernel_15752\2568459189.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  priyanshu['speed'][0]= 125

In [70]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai
4      1111    111            yyyyS

In [71]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [72]:
priyanshu['city'][2] = "Gola Gokarnnath"

C:\Users\verma\AppData\Local\Temp\ipykernel_15752\1859741309.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  priyanshu['city'][2] = "Gola Gokarnnath"
C:\Users\verma\AppData\Local\Temp\ipykernel_15752\1859741309.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  priyanshu['city'][2] = "Gola Gokarnnath"

In [73]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai
4      1111    111            yyyyS

In [74]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [75]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai
4      1111    111            yyyyS

In [76]:
priyanshu.index = ['first', 'second','third','fourth']

ValueError: Length mismatch: Expected axis has 5 elements, new values have 4 elements

In [ ]:
priyanshu

        train_no  speed             city
first      12344    125          lucknow
second     23444    344            delhi
third      23322    133  Gola Gokarnnath
fourth      2345    435          chennai

In [ ]:
ser = pd.Series(np.random.rand(22))

In [ ]:
type(ser)

pandas.core.series.Series

In [ ]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [ ]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.246766  0.820933  0.944749  0.260446  0.916908
1  0.128958  0.451689  0.107234  0.429729  0.720717
2  0.842731  0.699007  0.875206  0.034974  0.056903
3  0.129178  0.861065  0.379463  0.377612  0.509070
4  0.604030  0.329372  0.727480  0.451558  0.769433

In [ ]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf[0][0] = "priyanshu"

C:\Users\verma\AppData\Local\Temp\ipykernel_15752\475059861.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "priyanshu"
C:\Users\verma\AppData\Local\Temp\ipykernel_15752\475059861.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'priyanshu' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "priyanshu"

In [ ]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf.head()

           0         1         2         3         4
0  priyanshu  0.820933  0.944749  0.260446  0.916908
1   0.128958  0.451689  0.107234  0.429729  0.720717
2   0.842731  0.699007  0.875206  0.034974  0.056903
3   0.129178  0.861065  0.379463  0.377612  0.509070
4    0.60403  0.329372  0.727480  0.451558  0.769433

In [ ]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [ ]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [ ]:
newdf.to_numpy()

array([['priyanshu', 0.8209330735928764, 0.9447487923231176,
        0.26044604336638155, 0.9169083624861221],
       [0.12895840251712265, 0.4516886246966394, 0.10723401371770958,
        0.42972914258157224, 0.7207170389253682],
       [0.8427307002436629, 0.6990065339943154, 0.8752061278659542,
        0.0349739261933224, 0.05690268492854844],
       ...,
       [0.9040678077826416, 0.6899925764247895, 0.6877309848239228,
        0.21557745797468797, 0.2681582680519967],
       [0.17876183330449247, 0.6126085957849713, 0.7269977379453134,
        0.391652369143341, 0.7935897066509023],
       [0.9205470536112768, 0.1988523598936941, 0.4861892412164801,
        0.820643718000544, 0.38176435095430483]], dtype=object)

In [ ]:
newdf[0][0] = 0.34356

In [ ]:
newdf[3][2] = 0.2244

C:\Users\verma\AppData\Local\Temp\ipykernel_15752\343592338.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[3][2] = 0.2244
C:\Users\verma\AppData\Local\Temp\ipykernel_15752\343592338.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[3][2] = 0.2244

In [ ]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf

            0         1         2         3         4
0     0.34356  0.820933  0.944749  0.260446  0.916908
1    0.128958  0.451689  0.107234  0.429729  0.720717
2    0.842731  0.699007  0.875206  0.224400  0.056903
3    0.129178  0.861065  0.379463  0.377612  0.509070
4     0.60403  0.329372  0.727480  0.451558  0.769433
..        ...       ...       ...       ...       ...
329  0.489396  0.443003  0.399427  0.037499  0.999848
330  0.844085  0.402215  0.672437  0.592985  0.577115
331  0.904068  0.689993  0.687731  0.215577  0.268158
332  0.178762  0.612609  0.726998  0.391652  0.793590
333  0.920547  0.198852  0.486189  0.820644  0.381764

[334 rows x 5 columns]

In [ ]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.34356,0.128958,0.842731,0.129178,0.60403,0.092887,0.704222,0.93549,0.077549,0.005788,...,0.223316,0.55669,0.45607,0.244583,0.631555,0.489396,0.844085,0.904068,0.178762,0.920547
1,0.820933,0.451689,0.699007,0.861065,0.329372,0.907657,0.649398,0.557401,0.547849,0.736219,...,0.710281,0.350168,0.97316,0.404693,0.529517,0.443003,0.402215,0.689993,0.612609,0.198852
2,0.944749,0.107234,0.875206,0.379463,0.72748,0.301793,0.516941,0.69622,0.793301,0.929981,...,0.449784,0.822997,0.771835,0.945888,0.872458,0.399427,0.672437,0.687731,0.726998,0.486189
3,0.260446,0.429729,0.2244,0.377612,0.451558,0.838883,0.170137,0.352066,0.001276,0.350765,...,0.295428,0.296195,0.98596,0.533222,0.7735,0.037499,0.592985,0.215577,0.391652,0.820644
4,0.916908,0.720717,0.056903,0.50907,0.769433,0.939916,0.90751,0.915438,0.289976,0.484228,...,0.504643,0.591759,0.713167,0.865929,0.982385,0.999848,0.577115,0.268158,0.79359,0.381764